### 작업 1 유형

In [1]:
import pandas as pd
df = pd.read_csv('https://raw.githubusercontent.com/Datamanim/datarepo/main/bank/train.csv')
df.head()

,ID,age,job,marital,education,default,balance,housing,loan,contact,day,month,campaign,pdays,previous,poutcome,y
0,13829,29,technician,single,tertiary,no,18254,no,no,cellular,11,may,2,-1,0,unknown,no
1,22677,26,services,single,secondary,no,512,yes,yes,unknown,5,jun,3,-1,0,unknown,no
2,10541,30,management,single,secondary,no,135,no,no,cellular,14,aug,2,-1,0,unknown,no
3,13689,41,technician,married,unknown,no,30,yes,no,cellular,10,jul,1,-1,0,unknown,no
4,11304,27,admin.,single,secondary,no,321,no,yes,unknown,2,sep,1,-1,0,unknown,no

In [15]:
df['y'].unique()

array(['no', 'yes'], dtype=object)

### Q1 마케팅 응답 고객들의 나이를 10살 단위로 변환 했을 때, 가장 많은 인원을 가진 나이대는? (0~9 : 0 , 10 ~ 19 : 10)

In [12]:
# df.age를 나이대로 변경하고
# value_counts(): 각 나이대 몇 명있는지 개수 카운트 => 내림차순으로 정렬된 series 반환
res = (df.age // 10 * 10).value_counts()
print(res)

age
30    5056
40    3198
50    2244
20    1638
60     460
70     193
80      57
10      18
90       6
Name: count, dtype: int64

### Q2. 마케팅 응답 고객들의 나이를 10살 단위로 변환 했을 때, 가장 많은 나이대 구간의 인원은 몇명인가?

In [27]:
# df가 마케팅 응답 고객 데이터...
res = (df.age // 10 * 10).value_counts().values[0]
print(res)
# target = df[df['y'] == 'yes'].age
# res = (target // 10 * 10).value_counts()
# print(res)

5056

### Q3. 나이가 25살 이상 29살 미만인 응답 고객들중 housing컬럼의 값이 yes인 고객의 수는?

In [32]:
target = df[(25 <= df.age) & (df.age < 29)].housing
res = target[target.values == 'yes']
print(len(res))

504

In [33]:
# 모범답안..
res = df[(df.age >= 25) & (df.age < 29) & (df.housing=='yes')].shape[0]
print(res)

504

### Q4. numeric한 값을 가지지 않은 컬럼들중 unique한 값을 가장 많이 가지는 컬럼은?

In [61]:
df.describe()

,ID,age,balance,day,campaign,pdays,previous
count,12870.000000,12870.000000,12870.000000,12870.000000,12870.000000,12870.000000,12870.000000
mean,16434.500000,41.091142,1483.774437,15.641103,2.659130,45.555478,0.688967
std,3715.393317,11.305560,3311.055181,8.368983,2.863507,104.449411,2.049696
min,10000.000000,18.000000,-6847.000000,1.000000,1.000000,-1.000000,0.000000
25%,13217.250000,32.000000,102.000000,8.000000,1.000000,-1.000000,0.000000
50%,16434.500000,39.000000,515.000000,16.000000,2.000000,-1.000000,0.000000
75%,19651.750000,49.000000,1591.750000,21.000000,3.000000,-1.000000,0.000000
max,22869.000000,95.000000,102127.000000,31.000000,43.000000,854.000000,58.000000

In [40]:
# 노가다..
res = df.job.unique()
print(len(res))

12

In [42]:
# 모범답안
lst= [] 
for col in df.select_dtypes(exclude='int'):
    target = df[col]
    lst.append([col,target.nunique()])

dfs  = pd.DataFrame(lst).sort_values(1,ascending=False)
result = dfs[dfs[1] ==dfs[1].max()][0].values
print(result)

['job' 'month']

### Q5.balance 컬럼값들의 평균값 이상을 가지는 데이터를 ID값을 기준으로 내림차순 정렬했을때 상위 100개 데이터의 balance값의 평균은?

In [54]:
m = (df.balance).mean()
target = df[df.balance >= m]
res = target.sort_values('ID', ascending=False)
res2 = res.iloc[:100, :]
print(res2.balance.mean())

3473.73

In [55]:
# 모범답안
res = df[df.balance >= df.balance.mean()].sort_values('ID',ascending=False).head(100).balance.mean()
print(res)

3473.73

### Q6.가장 많은 광고를 집행했던 날짜는 언제인가? (데이터 그대로 일(숫자),달(영문)으로 표기)

- 날짜 기준 value_counts() 해서 max 값 반환

In [67]:
target = df[['day', 'month']].value_counts()
print(target.index[0])

(15, 'may')

### Q7. 데이터의 job이 unknown 상태인 고객들의 age 컬럼 값의 정규성을 검정하고자 한다. 샤피로 검정의 p-value값을 구하여라

In [ ]:
# df.job == uknown
target = df[df.job == 'unknown']
from scipy.stats import shapiro
print(shapiro(target.age)[1])

### !!!! Q8. age와 balance의 **상관계수**를 구하여라

**.corr()** : 수치형 변수들 간의 선형 상관관계(피어슨 상관계수) 계산

In [75]:
res = df[['age', 'balance']].corr()
print(res)

              age   balance
age      1.000000  0.101987
balance  0.101987  1.000000

In [77]:
# 모범답안
res = df[['age','balance']].corr().iloc[0,1]
print(res)

0.10198734763981461

### Q9. y 변수와 education 변수는 독립인지 카이제곱검정을 통해 확인하려한다. p-value값을 출력하라

In [85]:
# 정규성 검정
# 등분산성 검정
# 둘다 유의하면 카이제곱 검정??

from scipy.stats import chi2_contingency
# 인코딩 필요..
# 두 범주형 변수의 교차표를 만드는 함수!! : pd.crosstab
tar = pd.crosstab(df['y'],df['education'])
print(tar)
# 모집단이 두 개의 변수에 의해 범주화 되었음!! => chi2_contingency 사용
print(chi2_contingency(tar)[1])

education  primary  secondary  tertiary  unknown
y
no            1424       4555      2559      365
yes            456       1813      1516      182
7.901201277473555e-29

### Q10. 각 job에 따라 divorced/married 인원의 비율을 확인 했을 때 그 값이 가장 높은 값은?

In [114]:
tar = df.groupby(['job', 'marital']).size().reset_index()
# print(tar)

pivotdf = tar.pivot_table(index='job', columns='marital')[0].fillna(0)
print(pivotdf)
pivotdf['ratio'] = pivotdf['divorced'] / pivotdf['married']
res = pivotdf.sort_values('ratio', ascending=False)
print(res.ratio[0])
# res = tar.groupby('job').pivot_table(index='job', columns='marital', values='size')
# res = tar.groupby('job').marital.value_counts().to_frame()
# print(res)
# t = res.reset_index().pivot(index='job', columns='marital', values = 'count')
# print(t)
# total = t.divorced / t.married
# print(total)

marital        divorced  married  single
job
admin.            207.0    762.0   495.0
blue-collar       205.0   1775.0   591.0
entrepreneur       44.0    272.0    67.0
housemaid          49.0    245.0    40.0
management        323.0   1580.0   955.0
retired           157.0    572.0    41.0
self-employed      39.0    284.0   131.0
services          138.0    584.0   321.0
student             0.0     24.0   334.0
technician        246.0   1115.0   780.0
unemployed         62.0    219.0   133.0
unknown             5.0     58.0    17.0
0.2831050228310502

/var/folders/wm/x6pc4kss2pq5vy_73n02wdqc0000gn/T/ipykernel_82933/2022894509.py:8: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  print(res.ratio[0])

# 작업 2유형

In [122]:
import pandas as pd
train = pd.read_csv('https://raw.githubusercontent.com/Datamanim/datarepo/main/bank/train.csv')
test = pd.read_csv('https://raw.githubusercontent.com/Datamanim/datarepo/main/bank/test.csv')
submission = pd.read_csv('https://raw.githubusercontent.com/Datamanim/datarepo/main/bank/submission.csv')

display(train.head())
display(test.head())
# print(submission.predict)
display(submission.head())

,ID,age,job,marital,education,default,balance,housing,loan,contact,day,month,campaign,pdays,previous,poutcome,y
0,13829,29,technician,single,tertiary,no,18254,no,no,cellular,11,may,2,-1,0,unknown,no
1,22677,26,services,single,secondary,no,512,yes,yes,unknown,5,jun,3,-1,0,unknown,no
2,10541,30,management,single,secondary,no,135,no,no,cellular,14,aug,2,-1,0,unknown,no
3,13689,41,technician,married,unknown,no,30,yes,no,cellular,10,jul,1,-1,0,unknown,no
4,11304,27,admin.,single,secondary,no,321,no,yes,unknown,2,sep,1,-1,0,unknown,no

,ID,age,job,marital,education,default,balance,housing,loan,contact,day,month,campaign,pdays,previous,poutcome
0,53608,32,management,single,tertiary,no,12569,no,no,cellular,1,jul,2,295,2,success
1,51055,25,services,single,secondary,no,801,no,no,cellular,5,jun,2,-1,0,unknown
2,52573,46,blue-collar,married,secondary,no,1728,yes,no,unknown,26,may,2,-1,0,unknown
3,50458,39,management,divorced,secondary,no,51,no,no,unknown,17,jun,2,-1,0,unknown
4,52272,31,services,single,tertiary,no,1626,no,no,unknown,31,jul,1,-1,0,unknown

      ID  predict
0  53608      0.0
1  51055      0.0
2  52573      0.0
3  50458      0.0
4  52272      0.0

In [125]:
# 모델링, submission 파일 생성
from sklearn.model_selection import train_test_split

x = train.drop(columns=['ID','y'])
xd = pd.get_dummies(x)
y = train['y']

x_train, x_test, y_train, y_test = train_test_split(xd, y, stratify = y, random_state=42)

from sklearn.ensemble import RandomForestClassifier
rf = RandomForestClassifier()
rf.fit(x_train, y_train)
pred = rf.predict_proba(x_test)
print(pred)
from sklearn.metrics import roc_auc_score, classification_report
print('test roc score: ', roc_auc_score(y_test, pred[:,1]))

test_pred = rf.predict_proba(pd.get_dummies(test.drop(columns=['ID'])))
submission['predict'] = test_pred[:,1]
print('submission file')
display(submission.head())
# submission.to_csv('0000000.csv', index=False)

[[0.83 0.17]
 [0.95 0.05]
 [0.92 0.08]
 ...
 [0.72 0.28]
 [0.82 0.18]
 [0.75 0.25]]
test roc score:  0.785533368475205
submission file

      ID  predict
0  53608     0.79
1  51055     0.93
2  52573     0.11
3  50458     0.15
4  52272     0.35